// обєднання типів
// type sn=string|number
// let n:sn='s'
// n=1

//////////////////////////////////////////////////

// class User{

// }
// class Animal{

// }
// type sn=User|Animal
// // матюкатися не буде
// let n:sn='s'
// n=1

/////////////////////////////////

// строковий літерали
// let n:'n1'|'n2'|'n3'
// n='n3'

///////////////////////////////////////

// типи обгортки
// let n1:Number=new Number(1)
// let n2:number=1

/////////////////////////////////////////

// приведення типів два варіанти

// let str:any='qwe';
// (<string>str).length;
// (str as string).length

//////////////////////////////////////

